# Database Admin with Python

Objectives:

    Use Python to create a MySQL database
    Save a pandas data frame as a table in a MySQL database

You have already had some experience using SQLAlchemy to execute SQL queries within Python. The ability to transition between SQL and Python is an important skill for data scientists.  This lesson shows you how to create a MySQL database using python, and then how to add pandas data frames to the database. When you are finished, you will be able to open your database in MySQL workbench.

Do NOT use Colab!

You will need to work in a Jupyter Notebook in the dojo-env.

## (Refresher) PyMySQL and SQLAlchemy

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/Database_Admin_with_Python_tshirt"

## Create the engine

In [2]:
engine = create_engine(connection_str)

You can use execute any SQL query with pd.read_sql and your engine.  This includes any of the CRUD processes. (Except for the CREATE DATABASE which can be done with the code below.
IMPORTANT NOTE: Your connection_str must end with the name of the NEW database you want to create. 

In the code above, the new database was named "new_db", but you will want to change this to be something more appropriate for the data.

## Create a New Database

In [3]:
create_database(connection_str)

In [4]:
database_exists(connection_str)

True

## Solving Errors when running create_database for a 2nd time.


    create_database will error if the database already exists.
        To get around this, we can use an if/else statement to FIRST check if the database exists and if it DOESN'T, 
        create it.

In [5]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

If the database with that name already exists, you need to choose a different name.

Now you can go to MySQL workbench and you will see that the "practice" database is added to your list of schemas:

## Making a data frame a table in a MySQL database

Now that we have created our database, we are going to add tables to it using pandas dataframes.

For this exercise, we will use this simple tshirt dataset as our dataframe.

In [6]:
import pandas as pd
df = pd.read_csv('data/Tshirt.csv')
df.head()

  Size  Color  Cost Sold
0    S   Blue  5.00    Y
1    M    Red  7.49    Y
2    M  Green  8.00    N
3   XL  Green  4.00    N
4    L    Red  9.99    Y

In [7]:
df.to_sql('tshirts', engine, if_exists = 'replace')

9

In [8]:
q = """SELECT * FROM tshirts LIMIT 5;"""
pd.read_sql(q, engine)

   index Size  Color  Cost Sold
0      0    S   Blue  5.00    Y
1      1    M    Red  7.49    Y
2      2    M  Green  8.00    N
3      3   XL  Green  4.00    N
4      4    L    Red  9.99    Y

In [9]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_database_admin_with_python_tshirt
0                                     tshirts

Congratulations! You are now able to move data from pandas to MySQL!